Baanaaana/esp32-irk-finder/src/main.cpp
/*
 * ESP32 IRK Finder - Based on ESP-IDF Bluedroid example
 * Retrieves iPhone IRK through BLE pairing
 */

#include <Arduino.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "esp_system.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "esp_bt.h"
#include "esp_gap_ble_api.h"
#include "esp_gatts_api.h"
#include "esp_bt_defs.h"
#include "esp_bt_main.h"
#include "esp_bt_device.h"
#include "esp32-hal.h"

#include <WiFi.h>
#include <ESPAsyncWebServer.h>
#include <AsyncTCP.h>
#include <Preferences.h>
#include <ArduinoJson.h>
#include "config.h"

// Web server
AsyncWebServer server(WEB_SERVER_PORT);

// Preferences for storing WiFi credentials
Preferences preferences;

// WiFi configuration
String stored_ssid = "";
String stored_password = "";
bool isAPMode = false;

// Global IRK storage
String currentIRK = "No IRK retrieved yet";
String currentIRKBase64 = "";
String currentIRKReversed = "";
String currentIRKArray = "";
String connectedDeviceMAC = "None";
bool irkRetrieved = false;

// Helper function to encode bytes to Base64
String base64Encode(const uint8_t* data, size_t length) {
    const char* table = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
    String result;

    for (size_t i = 0; i < length; i += 3) {
        uint32_t value = data[i] << 16;
        if (i + 1 < length) value |= data[i + 1] << 8;
        if (i + 2 < length) value |= data[i + 2];

        result += table[(value >> 18) & 0x3F];
        result += table[(value >> 12) & 0x3F];
        result += (i + 1 < length) ? table[(value >> 6) & 0x3F] : '=';
        result += (i + 2 < length) ? table[value & 0x3F] : '=';
    }

    return result;
}

// Helper function to reverse IRK bytes for ESPresense
String reverseIRK(const uint8_t* irk) {
    char reversed[33];
    for (int i = 0; i < 16; i++) {
        sprintf(&reversed[i * 2], "%02X", irk[15 - i]);
    }
    reversed[32] = '\0';
    return String(reversed);
}

// Helper function to format IRK as hex array
String formatIRKArray(const uint8_t* irk) {
    String result = "";
    for (int i = 0; i < 16; i++) {
        if (i > 0) result += ",";
        char hex[6];
        sprintf(hex, "0x%02X", irk[i]);
        result += hex;
    }
    return result;
}

// BLE Configuration
#define GATTS_TABLE_TAG "ESP32_IRK"
#define HEART_PROFILE_NUM                         1
#define HEART_PROFILE_APP_IDX                     0
#define ESP_HEART_RATE_APP_ID                     0x55
#define EXAMPLE_DEVICE_NAME                       "ESP32_IRK_FINDER"
#define HEART_RATE_SVC_INST_ID                    0

#define ADV_CONFIG_FLAG                           (1 << 0)
#define SCAN_RSP_CONFIG_FLAG                      (1 << 1)

static uint8_t adv_config_done = 0;

// Attributes State Machine
enum {
    HRS_IDX_SVC,
    HRS_IDX_HR_MEAS_CHAR,
    HRS_IDX_HR_MEAS_VAL,
    HRS_IDX_HR_MEAS_NTF_CFG,
    HRS_IDX_BOBY_SENSOR_LOC_CHAR,
    HRS_IDX_BOBY_SENSOR_LOC_VAL,
    HRS_IDX_HR_CTNL_PT_CHAR,
    HRS_IDX_HR_CTNL_PT_VAL,
    HRS_IDX_NB,
};

static uint16_t heart_rate_handle_table[HRS_IDX_NB];
static uint8_t test_manufacturer[3] = {'E', 'S', 'P'};

static uint8_t sec_service_uuid[16] = {
    0xfb, 0x34, 0x9b, 0x5f, 0x80, 0x00, 0x00, 0x80,
    0x00, 0x10, 0x00, 0x00, 0x18, 0x0D, 0x00, 0x00,
};

// Advertising configuration
esp_ble_adv_data_t heart_rate_adv_config = {};
esp_ble_adv_data_t heart_rate_scan_rsp_config = {};
esp_ble_adv_params_t heart_rate_adv_params = {};

struct gatts_profile_inst {
    esp_gatts_cb_t gatts_cb;
    uint16_t gatts_if;
    uint16_t app_id;
    uint16_t conn_id;
    uint16_t service_handle;
    esp_gatt_srvc_id_t service_id;
    uint16_t char_handle;
    esp_bt_uuid_t char_uuid;
    esp_gatt_perm_t perm;
    esp_gatt_char_prop_t property;
    uint16_t descr_handle;
    esp_bt_uuid_t descr_uuid;
};

static void gatts_profile_event_handler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param);

static struct gatts_profile_inst heart_rate_profile_tab[HEART_PROFILE_NUM] = {
    [HEART_PROFILE_APP_IDX] = {
        .gatts_cb = gatts_profile_event_handler,
        .gatts_if = ESP_GATT_IF_NONE,
    },
};

// GATT Database
static const uint16_t GATTS_SERVICE_UUID_HEART_RATE = 0x180D;
static const uint16_t GATTS_CHAR_UUID_HEART_RATE_MEASUREMENT = 0x2A37;
static const uint16_t primary_service_uuid = ESP_GATT_UUID_PRI_SERVICE;
static const uint16_t character_declaration_uuid = ESP_GATT_UUID_CHAR_DECLARE;
static const uint16_t character_client_config_uuid = ESP_GATT_UUID_CHAR_CLIENT_CONFIG;
static const uint8_t char_prop_notify = ESP_GATT_CHAR_PROP_BIT_NOTIFY;
static const uint8_t char_prop_read = ESP_GATT_CHAR_PROP_BIT_READ;
static const uint8_t char_prop_read_write = ESP_GATT_CHAR_PROP_BIT_WRITE | ESP_GATT_CHAR_PROP_BIT_READ;

static const uint16_t heart_rate_meas_uuid = ESP_GATT_HEART_RATE_MEAS;
static const uint8_t heart_measurement_ccc[2] = {0x00, 0x00};
static const uint16_t body_sensor_location_uuid = ESP_GATT_BODY_SENSOR_LOCATION;
static const uint8_t body_sensor_loc_val[1] = {0x00};
static const uint16_t heart_rate_ctrl_point = ESP_GATT_HEART_RATE_CNTL_POINT;
static const uint8_t heart_ctrl_point[1] = {0x00};

// HTML page for web interface
const char index_html[] PROGMEM = R"rawliteral(
<!DOCTYPE HTML>
<html>
<head>
    <title>ESP32 IRK Finder</title>
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <style>
        * {
            margin: 0;
            padding: 0;
            box-sizing: border-box;
        }

        :root {
            --background: #ffffff;
            --foreground: #0a0a0a;
            --card: #ffffff;
            --card-foreground: #0a0a0a;
            --popover: #ffffff;
            --popover-foreground: #0a0a0a;
            --primary: #171717;
            --primary-foreground: #fafafa;
            --secondary: #f5f5f5;
            --secondary-foreground: #171717;
            --muted: #f5f5f5;
            --muted-foreground: #737373;
            --accent: #f5f5f5;
            --accent-foreground: #171717;
            --destructive: #ef4444;
            --destructive-foreground: #fafafa;
            --border: #e5e5e5;
            --input: #e5e5e5;
            --ring: #171717;
            --radius: 0.5rem;
        }

        body {
            font-family: -apple-system, BlinkMacSystemFont, "Segoe UI", "Roboto", "Oxygen", "Ubuntu", "Cantarell", "Fira Sans", "Droid Sans", "Helvetica Neue", sans-serif;
            line-height: 1.5;
            color: var(--foreground);
            background: linear-gradient(to bottom, #fafafa, #f5f5f5);
            min-height: 100vh;
            padding: 1rem;
        }

        .container {
            max-width: 48rem;
            margin: 0 auto;
            padding: 2rem;
        }

        h1 {
            font-size: 2rem;
            font-weight: 700;
            text-align: center;
            margin-bottom: 2rem;
            background: linear-gradient(to right, #171717, #404040);
            -webkit-background-clip: text;
            -webkit-text-fill-color: transparent;
            background-clip: text;
        }

        .alert {
            padding: 0.75rem 1rem;
            border-radius: var(--radius);
            margin-bottom: 1.5rem;
            font-size: 0.875rem;
            font-weight: 500;
            text-align: center;
        }

        .alert-success {
            background-color: #dcfce7;
            color: #166534;
            border: 1px solid #bbf7d0;
        }

        .alert-warning {
            background-color: #fef3c7;
            color: #92400e;
            border: 1px solid #fde68a;
        }

        .card {
            background: var(--card);
            border-radius: var(--radius);
            border: 1px solid var(--border);
            box-shadow: 0 1px 3px 0 rgb(0 0 0 / 0.1), 0 1px 2px -1px rgb(0 0 0 / 0.1);
            margin-bottom: 1rem;
        }

        .card-content {
            padding: 1.5rem;
        }

        .label {
            font-size: 0.875rem;
            font-weight: 600;
            color: var(--foreground);
            margin-bottom: 0.25rem;
        }

