Baanaaana/esp32-irk-finder/src/main.cpp
        function saveWiFi() {
            const ssid = document.getElementById('ssid').value;
            const password = document.getElementById('password').value;

            if (!ssid) {
                alert('Please enter WiFi SSID');
                return;
            }

            fetch('/api/wifi/save', {
                method: 'POST',
                headers: { 'Content-Type': 'application/json' },
                body: JSON.stringify({ ssid, password })
            })
            .then(response => response.json())
            .then(data => {
                if (data.success) {
                    alert('WiFi settings saved! ESP32 will restart and connect to the network.');
                    setTimeout(() => { window.location.href = '/'; }, 3000);
                } else {
                    alert('Failed to save WiFi settings');
                }
            });
        }

        function clearWiFi() {
            if (confirm('Clear saved WiFi credentials?')) {
                fetch('/api/wifi/clear', { method: 'POST' })
                    .then(response => response.json())
                    .then(data => {
                        alert('WiFi credentials cleared');
                        location.reload();
                    });
            }
        }

        window.onload = () => {
            scanNetworks();
            scanInterval = setInterval(scanNetworks, 10000); // Scan every 10 seconds
        };

        window.onbeforeunload = () => {
            if (scanInterval) clearInterval(scanInterval);
        };
    </script>
</head>
<body>
    <div class="container">
        <h1>WiFi Configuration</h1>

        <div class="alert alert-info">
            Connect ESP32 to your WiFi network
        </div>

        <div class="card">
            <div class="card-content">
                <h3 style="margin-bottom: 1rem;">Available Networks</h3>
                <div id="networks-list" class="networks-list">
                    <div class="loading">Scanning...</div>
                </div>
                <button class="btn btn-secondary" onclick="scanNetworks()">Refresh</button>
            </div>
        </div>

        <div class="card">
            <div class="card-content">
                <div class="form-group">
                    <label class="label" for="ssid">WiFi SSID</label>
                    <input type="text" id="ssid" class="input" placeholder="Enter or select WiFi network">
                </div>
                <div class="form-group">
                    <label class="label" for="password">WiFi Password</label>
                    <input type="password" id="password" class="input" placeholder="Enter WiFi password">
                </div>
                <button class="btn btn-primary" onclick="saveWiFi()">Save & Connect</button>
                <button class="btn btn-secondary mt-2" onclick="clearWiFi()">Clear Saved Credentials</button>
            </div>
        </div>

        <div style="text-align: center; margin-top: 2rem;">
            <a href="/" class="link">← Back to IRK Finder</a>
        </div>
    </div>
</body>
</html>
)rawliteral";

// Full HRS Database Description
static const esp_gatts_attr_db_t heart_rate_gatt_db[HRS_IDX_NB] = {
    // Heart Rate Service Declaration
    [HRS_IDX_SVC] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&primary_service_uuid, ESP_GATT_PERM_READ,
         sizeof(uint16_t), sizeof(GATTS_SERVICE_UUID_HEART_RATE), (uint8_t *)&GATTS_SERVICE_UUID_HEART_RATE}
    },

    // Heart Rate Measurement Characteristic Declaration
    [HRS_IDX_HR_MEAS_CHAR] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&character_declaration_uuid, ESP_GATT_PERM_READ,
         sizeof(uint8_t), sizeof(uint8_t), (uint8_t *)&char_prop_notify}
    },

    // Heart Rate Measurement Characteristic Value
    [HRS_IDX_HR_MEAS_VAL] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&heart_rate_meas_uuid, ESP_GATT_PERM_READ,
         13, 0, NULL}
    },

    // Heart Rate Measurement Characteristic - Client Characteristic Configuration Descriptor
    [HRS_IDX_HR_MEAS_NTF_CFG] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&character_client_config_uuid, ESP_GATT_PERM_READ | ESP_GATT_PERM_WRITE,
         sizeof(uint16_t), sizeof(heart_measurement_ccc), (uint8_t *)heart_measurement_ccc}
    },

    // Body Sensor Location Characteristic Declaration
    [HRS_IDX_BOBY_SENSOR_LOC_CHAR] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&character_declaration_uuid, ESP_GATT_PERM_READ,
         sizeof(uint8_t), sizeof(uint8_t), (uint8_t *)&char_prop_read}
    },

    // Body Sensor Location Characteristic Value
    [HRS_IDX_BOBY_SENSOR_LOC_VAL] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&body_sensor_location_uuid, ESP_GATT_PERM_READ_ENCRYPTED,
         sizeof(uint8_t), sizeof(body_sensor_loc_val), (uint8_t *)body_sensor_loc_val}
    },

    // Heart Rate Control Point Characteristic Declaration
    [HRS_IDX_HR_CTNL_PT_CHAR] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&character_declaration_uuid, ESP_GATT_PERM_READ,
         sizeof(uint8_t), sizeof(uint8_t), (uint8_t *)&char_prop_read_write}
    },

    // Heart Rate Control Point Characteristic Value
    [HRS_IDX_HR_CTNL_PT_VAL] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&heart_rate_ctrl_point, ESP_GATT_PERM_WRITE_ENCRYPTED | ESP_GATT_PERM_READ_ENCRYPTED,
         sizeof(uint8_t), sizeof(heart_ctrl_point), (uint8_t *)heart_ctrl_point}
    },
};

// Function to show bonded devices and extract IRK
static void show_bonded_devices(void) {
    int dev_num = esp_ble_get_bond_device_num();

    if(dev_num == 0) {
        ESP_LOGI(GATTS_TABLE_TAG, "No bonded devices");
        return;
    }

    esp_ble_bond_dev_t *dev_list = (esp_ble_bond_dev_t *)malloc(sizeof(esp_ble_bond_dev_t) * dev_num);
    esp_ble_get_bond_device_list(&dev_num, dev_list);
    ESP_LOGI(GATTS_TABLE_TAG, "Bonded devices: %d", dev_num);

    for (int i = 0; i < dev_num; i++) {
        // Extract MAC address
        char mac_str[18];
        sprintf(mac_str, "%02X:%02X:%02X:%02X:%02X:%02X",
                dev_list[i].bd_addr[0], dev_list[i].bd_addr[1],
                dev_list[i].bd_addr[2], dev_list[i].bd_addr[3],
                dev_list[i].bd_addr[4], dev_list[i].bd_addr[5]);

        connectedDeviceMAC = String(mac_str);

        // Extract IRK
        char irk_str[33];
        uint8_t* irk_bytes = dev_list[i].bond_key.pid_key.irk;

