Baanaaana/esp32-irk-finder/src/main.cpp
        for(int j = 0; j < 16; j++) {
            sprintf(&irk_str[j * 2], "%02X", irk_bytes[j]);
        }
        irk_str[32] = '\0';

        currentIRK = String(irk_str);
        currentIRKBase64 = base64Encode(irk_bytes, 16);
        currentIRKReversed = reverseIRK(irk_bytes);
        currentIRKArray = formatIRKArray(irk_bytes);
        irkRetrieved = true;

        ESP_LOGI(GATTS_TABLE_TAG, "=================================");
        ESP_LOGI(GATTS_TABLE_TAG, "Device MAC: %s", mac_str);
        ESP_LOGI(GATTS_TABLE_TAG, "IRK (Hex): %s", irk_str);
        ESP_LOGI(GATTS_TABLE_TAG, "IRK (ESPresense): %s", currentIRKReversed.c_str());
        ESP_LOGI(GATTS_TABLE_TAG, "IRK (Base64): %s", currentIRKBase64.c_str());
        ESP_LOGI(GATTS_TABLE_TAG, "=================================");

        Serial.println("\n========================================");
        Serial.println("IRK SUCCESSFULLY RETRIEVED!");
        Serial.print("Device MAC: ");
        Serial.println(connectedDeviceMAC);
        Serial.println("\n--- IRK Formats ---");
        Serial.print("Standard Hex: ");
        Serial.println(currentIRK);
        Serial.print("ESPresense (reversed): ");
        Serial.println(currentIRKReversed);
        Serial.print("Base64 (HA Private BLE): ");
        Serial.println(currentIRKBase64);
        Serial.print("Hex Array: ");
        Serial.println(currentIRKArray);
        Serial.println("========================================\n");
    }

    free(dev_list);
}

// Remove all bonded devices
static void remove_all_bonded_devices(void) {
    int dev_num = esp_ble_get_bond_device_num();

    if(dev_num == 0) return;

    esp_ble_bond_dev_t *dev_list = (esp_ble_bond_dev_t *)malloc(sizeof(esp_ble_bond_dev_t) * dev_num);
    esp_ble_get_bond_device_list(&dev_num, dev_list);

    for (int i = 0; i < dev_num; i++) {
        esp_ble_remove_bond_device(dev_list[i].bd_addr);
    }

    free(dev_list);

    currentIRK = "No IRK retrieved yet";
    currentIRKBase64 = "";
    currentIRKReversed = "";
    currentIRKArray = "";
    connectedDeviceMAC = "None";
    irkRetrieved = false;
}

// GAP event handler
static void gap_event_handler(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param) {
    ESP_LOGV(GATTS_TABLE_TAG, "GAP_EVT, event:%d", event);

    switch (event) {
        case ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT:
            adv_config_done &= (~SCAN_RSP_CONFIG_FLAG);
            if (adv_config_done == 0) {
                esp_ble_gap_start_advertising(&heart_rate_adv_params);
            }
            break;

        case ESP_GAP_BLE_ADV_DATA_SET_COMPLETE_EVT:
            adv_config_done &= (~ADV_CONFIG_FLAG);
            if (adv_config_done == 0) {
                esp_ble_gap_start_advertising(&heart_rate_adv_params);
            }
            break;

        case ESP_GAP_BLE_ADV_START_COMPLETE_EVT:
            if (param->adv_start_cmpl.status != ESP_BT_STATUS_SUCCESS) {
                ESP_LOGE(GATTS_TABLE_TAG, "Advertising start failed");
            } else {
                ESP_LOGI(GATTS_TABLE_TAG, "Advertising started - Device name: ESP32_IRK_FINDER");
                Serial.println("BLE advertising started - look for 'ESP32_IRK_FINDER'");
            }
            break;

        case ESP_GAP_BLE_PASSKEY_NOTIF_EVT:
            ESP_LOGI(GATTS_TABLE_TAG, "Passkey: %06d", param->ble_security.key_notif.passkey);
            Serial.printf("Passkey displayed: %06d\n", param->ble_security.key_notif.passkey);
            break;

        case ESP_GAP_BLE_NC_REQ_EVT:
            esp_ble_confirm_reply(param->ble_security.ble_req.bd_addr, true);
            ESP_LOGI(GATTS_TABLE_TAG, "Numeric Comparison: %d", param->ble_security.key_notif.passkey);
            break;

        case ESP_GAP_BLE_SEC_REQ_EVT:
            esp_ble_gap_security_rsp(param->ble_security.ble_req.bd_addr, true);
            break;

        case ESP_GAP_BLE_AUTH_CMPL_EVT:
            if(param->ble_security.auth_cmpl.success) {
                ESP_LOGI(GATTS_TABLE_TAG, "Authentication success!");
                Serial.println("Authentication completed successfully!");
                // Show bonded devices to extract IRK
                show_bonded_devices();
            } else {
                ESP_LOGI(GATTS_TABLE_TAG, "Authentication failed, reason: 0x%x",
                         param->ble_security.auth_cmpl.fail_reason);
            }
            break;

        case ESP_GAP_BLE_SET_LOCAL_PRIVACY_COMPLETE_EVT: {
            if (param->local_privacy_cmpl.status != ESP_BT_STATUS_SUCCESS) {
                ESP_LOGE(GATTS_TABLE_TAG, "config local privacy failed");
                break;
            }

            esp_err_t ret = esp_ble_gap_config_adv_data(&heart_rate_adv_config);
            if (ret) {
                ESP_LOGE(GATTS_TABLE_TAG, "config adv data failed: %x", ret);
            } else {
                adv_config_done |= ADV_CONFIG_FLAG;
            }

            ret = esp_ble_gap_config_adv_data(&heart_rate_scan_rsp_config);
            if (ret) {
                ESP_LOGE(GATTS_TABLE_TAG, "config scan rsp data failed: %x", ret);
            } else {
                adv_config_done |= SCAN_RSP_CONFIG_FLAG;
            }
            break;
        }

        default:
            break;
    }
}

// GATTS profile event handler
static void gatts_profile_event_handler(esp_gatts_cb_event_t event,
                                        esp_gatt_if_t gatts_if,
                                        esp_ble_gatts_cb_param_t *param) {
    switch (event) {
        case ESP_GATTS_REG_EVT:
            esp_ble_gap_set_device_name(EXAMPLE_DEVICE_NAME);
            esp_ble_gap_config_local_privacy(true);
            esp_ble_gatts_create_attr_tab(heart_rate_gatt_db, gatts_if, HRS_IDX_NB, HEART_RATE_SVC_INST_ID);
            break;

        case ESP_GATTS_CONNECT_EVT:
            ESP_LOGI(GATTS_TABLE_TAG, "Device connected");
            Serial.println("Device connected - starting security");
            esp_ble_set_encryption(param->connect.remote_bda, ESP_BLE_SEC_ENCRYPT_MITM);
            break;

        case ESP_GATTS_DISCONNECT_EVT:
            ESP_LOGI(GATTS_TABLE_TAG, "Device disconnected");
            Serial.println("Device disconnected");
            esp_ble_gap_start_advertising(&heart_rate_adv_params);
            break;

        case ESP_GATTS_CREAT_ATTR_TAB_EVT:
            if (param->add_attr_tab.status == ESP_GATT_OK) {
                if(param->add_attr_tab.num_handle == HRS_IDX_NB) {
                    memcpy(heart_rate_handle_table, param->add_attr_tab.handles, sizeof(heart_rate_handle_table));
                    esp_ble_gatts_start_service(heart_rate_handle_table[HRS_IDX_SVC]);
                }
            }
            break;

        default:
            break;
    }
}

// Main GATTS event handler
static void gatts_event_handler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if,
                                esp_ble_gatts_cb_param_t *param) {
    if (event == ESP_GATTS_REG_EVT) {
        if (param->reg.status == ESP_GATT_OK) {
            heart_rate_profile_tab[HEART_PROFILE_APP_IDX].gatts_if = gatts_if;
        } else {
            return;
        }
    }

