Baanaaana/esp32-irk-finder/src/main.cpp
    for (int idx = 0; idx < HEART_PROFILE_NUM; idx++) {
        if (gatts_if == ESP_GATT_IF_NONE || gatts_if == heart_rate_profile_tab[idx].gatts_if) {
            if (heart_rate_profile_tab[idx].gatts_cb) {
                heart_rate_profile_tab[idx].gatts_cb(event, gatts_if, param);
            }
        }
    }
}

// Initialize Bluetooth
void BT_Init() {
    ESP_LOGI(GATTS_TABLE_TAG, "Initializing Bluetooth...");

    // Initialize NVS
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    // Start Bluetooth
    btStart();

    // Initialize Bluedroid
    esp_bluedroid_status_t bt_state = esp_bluedroid_get_status();
    if (bt_state == ESP_BLUEDROID_STATUS_UNINITIALIZED) {
        ESP_ERROR_CHECK(esp_bluedroid_init());
    }

    if (bt_state != ESP_BLUEDROID_STATUS_ENABLED) {
        ESP_ERROR_CHECK(esp_bluedroid_enable());
    }

    // Register callbacks
    ESP_ERROR_CHECK(esp_ble_gatts_register_callback(gatts_event_handler));
    ESP_ERROR_CHECK(esp_ble_gap_register_callback(gap_event_handler));
    ESP_ERROR_CHECK(esp_ble_gatts_app_register(ESP_HEART_RATE_APP_ID));

    // Configure security parameters
    esp_ble_auth_req_t auth_req = ESP_LE_AUTH_REQ_SC_MITM_BOND;
    esp_ble_io_cap_t iocap = ESP_IO_CAP_NONE;
    uint8_t key_size = 16;
    uint8_t init_key = ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK;
    uint8_t rsp_key = ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK;
    uint32_t passkey = 123456;
    uint8_t auth_option = ESP_BLE_ONLY_ACCEPT_SPECIFIED_AUTH_DISABLE;

    esp_ble_gap_set_security_param(ESP_BLE_SM_SET_STATIC_PASSKEY, &passkey, sizeof(uint32_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_AUTHEN_REQ_MODE, &auth_req, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_IOCAP_MODE, &iocap, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_MAX_KEY_SIZE, &key_size, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_ONLY_ACCEPT_SPECIFIED_SEC_AUTH, &auth_option, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_SET_INIT_KEY, &init_key, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_SET_RSP_KEY, &rsp_key, sizeof(uint8_t));

    Serial.println("Bluetooth initialized - Passkey: 123456");
}

// Setup WiFi with saved credentials or AP mode
void setupWiFi() {
    // Load saved WiFi credentials
    preferences.begin("wifi", false);
    stored_ssid = preferences.getString("ssid", "");
    stored_password = preferences.getString("password", "");
    preferences.end();

    // Try to connect if we have saved credentials
    if (stored_ssid.length() > 0) {
        Serial.println("Attempting to connect with saved WiFi credentials...");
        Serial.print("SSID: ");
        Serial.println(stored_ssid);

        WiFi.mode(WIFI_STA);
        WiFi.begin(stored_ssid.c_str(), stored_password.c_str());

        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 40) {  // 20 seconds timeout
            delay(500);
            Serial.print(".");
            attempts++;
        }

        if (WiFi.status() == WL_CONNECTED) {
            Serial.println("\nWiFi connected!");
            Serial.print("IP address: ");
            Serial.println(WiFi.localIP());
            isAPMode = false;
            return;
        } else {
            Serial.println("\nFailed to connect with saved credentials.");
        }
    }

    // Start AP mode if no credentials or connection failed
    Serial.println("Starting AP mode for configuration...");
    WiFi.mode(WIFI_AP);
    WiFi.softAP(AP_SSID, AP_PASSWORD);
    isAPMode = true;

    Serial.println("\n========================================");
    Serial.println("Access Point Started!");
    Serial.print("SSID: ");
    Serial.println(AP_SSID);
    Serial.print("Password: ");
    Serial.println(AP_PASSWORD);
    Serial.print("IP address: ");
    Serial.println(WiFi.softAPIP());
    Serial.println("========================================\n");
}

// Setup web server
void setupWebServer() {
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
        request->send_P(200, "text/html", index_html);
    });

    server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{";
        json += "\"irk\":\"" + currentIRK + "\",";
        json += "\"irkReversed\":\"" + currentIRKReversed + "\",";
        json += "\"irkBase64\":\"" + currentIRKBase64 + "\",";
        json += "\"irkArray\":\"" + currentIRKArray + "\",";
        json += "\"mac\":\"" + connectedDeviceMAC + "\",";
        json += "\"irkRetrieved\":" + String(irkRetrieved ? "true" : "false") + ",";
        json += "\"isAPMode\":" + String(isAPMode ? "true" : "false") + ",";
        json += "\"ipAddress\":\"" + (isAPMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString()) + "\"";
        json += "}";
        request->send(200, "application/json", json);
    });

    // WiFi Configuration page
    server.on("/wifi", HTTP_GET, [](AsyncWebServerRequest *request){
        request->send_P(200, "text/html", wifi_html);
    });

    // WiFi Scan API
    server.on("/api/wifi/scan", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{\"networks\":[";
        int n = WiFi.scanNetworks();

        for (int i = 0; i < n; i++) {
            if (i > 0) json += ",";
            json += "{";
            json += "\"ssid\":\"" + WiFi.SSID(i) + "\",";
            json += "\"rssi\":" + String(WiFi.RSSI(i)) + ",";
            json += "\"encryption\":" + String(WiFi.encryptionType(i));
            json += "}";
        }

        json += "]}";
        request->send(200, "application/json", json);
    });

    // Save WiFi credentials
    server.on("/api/wifi/save", HTTP_POST, [](AsyncWebServerRequest *request){}, NULL,
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total){
            DynamicJsonDocument doc(256);
            deserializeJson(doc, (char*)data);

            String ssid = doc["ssid"].as<String>();
            String password = doc["password"].as<String>();

