Baanaaana/esp32-irk-finder/src/main.cpp
            preferences.begin("wifi", false);
            preferences.putString("ssid", ssid);
            preferences.putString("password", password);
            preferences.end();

            String response = "{\"success\":true}";
            request->send(200, "application/json", response);

            delay(1000);
            ESP.restart();
        });

    // Clear WiFi credentials
    server.on("/api/wifi/clear", HTTP_POST, [](AsyncWebServerRequest *request){
        preferences.begin("wifi", false);
        preferences.clear();
        preferences.end();

        String response = "{\"success\":true}";
        request->send(200, "application/json", response);

        delay(1000);
        ESP.restart();
    });

    // WiFi status
    server.on("/api/wifi/status", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{";
        json += "\"connected\":" + String(WiFi.status() == WL_CONNECTED ? "true" : "false") + ",";
        json += "\"ssid\":\"" + (WiFi.status() == WL_CONNECTED ? WiFi.SSID() : "") + "\",";
        json += "\"ip\":\"" + (isAPMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString()) + "\",";
        json += "\"mode\":\"" + String(isAPMode ? "AP" : "Station") + "\"";
        json += "}";
        request->send(200, "application/json", json);
    });

    server.begin();
    Serial.println("Web server started");
}

void setup() {
    Serial.begin(115200);
    delay(1000);

    Serial.println("\n========================================");
    Serial.println("ESP32 IRK Finder - Bluedroid Version");
    Serial.println("========================================");

    // Setup LED
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);

    // Configure advertising
    heart_rate_adv_config.set_scan_rsp = false;
    heart_rate_adv_config.include_txpower = true;
    heart_rate_adv_config.min_interval = 0x0006;
    heart_rate_adv_config.max_interval = 0x0010;
    heart_rate_adv_config.appearance = 0x00;
    heart_rate_adv_config.manufacturer_len = 0;
    heart_rate_adv_config.p_manufacturer_data = NULL;
    heart_rate_adv_config.service_data_len = 0;
    heart_rate_adv_config.p_service_data = NULL;
    heart_rate_adv_config.service_uuid_len = sizeof(sec_service_uuid);
    heart_rate_adv_config.p_service_uuid = sec_service_uuid;
    heart_rate_adv_config.flag = (ESP_BLE_ADV_FLAG_GEN_DISC | ESP_BLE_ADV_FLAG_BREDR_NOT_SPT);

    heart_rate_scan_rsp_config.set_scan_rsp = true;
    heart_rate_scan_rsp_config.include_name = true;
    heart_rate_scan_rsp_config.manufacturer_len = sizeof(test_manufacturer);
    heart_rate_scan_rsp_config.p_manufacturer_data = test_manufacturer;

    heart_rate_adv_params.adv_int_min = 0x100;
    heart_rate_adv_params.adv_int_max = 0x100;
    heart_rate_adv_params.adv_type = ADV_TYPE_IND;
    heart_rate_adv_params.own_addr_type = BLE_ADDR_TYPE_RANDOM;
    heart_rate_adv_params.channel_map = ADV_CHNL_ALL;
    heart_rate_adv_params.adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY;

    // Setup WiFi
    setupWiFi();

    // Setup web server
    setupWebServer();

    // Initialize Bluetooth
    BT_Init();

    // Clear all bonded devices on startup
    delay(1000);
    remove_all_bonded_devices();

    Serial.println("\n========================================");
    Serial.println("System ready!");
    Serial.print("Web interface: http://");
    Serial.println(WiFi.localIP());
    Serial.println("BLE Device name: ESP32_IRK_FINDER");
    Serial.println("Passkey: 123456");
    Serial.println("========================================\n");
}

void loop() {
    delay(1000);

    // Check for bonded devices periodically
    static unsigned long lastCheck = 0;
    if (millis() - lastCheck > 5000) {
        lastCheck = millis();
        if (!irkRetrieved) {
            show_bonded_devices();
        }
    }
}